{"timestamp":1412679466,"status":"processed and cleaned","data":{"agenda_people":[{"id":"63","full_name":"Sebastian Rutka","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Sebastian Rutka pełni obecnie funkcje kierownika działu „Kernel \u0026 System Frameworks” w Samsung R\u0026D Institute Poland. Z racji zajmowanego stanowiska oraz specyfiki projektów przez niego prowadzonych jest również odpowiedzialny za współpracę ze społecznością wolnego oprogromowania.  W pracy łączy swoje zaintersowania z dziedziny zarządzania oraz nowoczesnych technologii.\r\n\r\n \r\n","website_url":"","picture_url":"","agenda_items":[{"id":"94","title":"Wielki projekt i wielka firma","description":"Prelegent opowie o tym jak przez ostatnie lata wyglądała sytuacja w tworzeniu dużych projektów programistycznych. Przedstawi zmiany rynku oraz spróbuje opowiedzieć co jest przyczyną takich zmian. Następnie pokaże przykład takiej współpracy w oparciu o doświadczenia wyniesione z pracy w Samsung R\u0026D Institute Poland","begin_date":"2014-10-18 15:30:00 +0200","end_date":"2014-10-18 16:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"46","full_name":"Sławomir Jasek","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Konsultant bezpieczeństwa IT z ponad 10-letnim doświadczeniem. Uczestniczył w dziesiątkach projektów z zakresu oceny bezpieczeństwa systemów informatycznych i aplikacji (w tym wielu mobilnych) - dla wiodących firm z sektora finansowego, branży internetowej, instytucji publicznych. Aktualnie coraz częściej doradza bezpieczne rozwiązania dla różnego typu aplikacji już od etapu projektowania. Od 9 lat związany zawodowo z firmą SecuRing. \r\n","website_url":"securing.pl","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/046/original/jasek.jpg?1411503091","agenda_items":[{"id":"69","title":"Testy bezpieczeństwa aplikacji mobilnych na przykładach","description":"Na rzeczywistych przykładach pokażę jak wygląda proces oceny bezpieczeństwa aplikacji mobilnych. Zobaczymy m.in. jak wykrywać słabości związane z przechowywaniem danych na urządzeniu, nieprawidłowości w transmisji, oraz najgroźniejsze - błędy w API po stronie serwera (np. błędy logiczne, kontroli dostępu, REST). Jednocześnie okaże się jakie techniki utrudniają ataki, jaki jest faktyczny wpływ na ryzyko poszczególnych podatności, oraz jakie zabezpieczenia warto zastosować w różnych aplikacjach.","begin_date":"2014-10-18 10:15:00 +0200","end_date":"2014-10-18 11:00:00 +0200","venue":"","language_id":"pl"}]},{"id":"1","full_name":"Maciej Górski","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Maciej is a passionate developer, but also a conference wanderer - during the last year, he spent more time listening (and sometimes speaking) to people during various conferences and meetups on topics mostly related to mobile and Java Eee, than sitting and coding behind his desk. He likes open source. Last year he worked at lot with the new Android API for maps, which resulted in the birth of a small library called Android Maps Extensions. This year he is working on Hrisey, a new kind of anti-boilerplate tool. When he\u0027s not programming, Maciej avoids computers and prefers to bike.\r\n\r\n \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/001/original/MaciejGorski.jpg?1406492942","agenda_items":[{"id":"90","title":"Boiling out Boilerplate\t","description":"Ever since we started developing for Android platform, we noticed that some tasks are repetitive: from simple things like finding views in our activities, to sending extras or creating fragments with arguments, to creating parcelable classes, to persisting data, to creating web service clients. This not only slows down initial development, but is mostly a problem when reviewing the code and later continuing to develop new features. During the talk I will show you many tools and libraries that are available to make your code base smaller, simpler and easier to maintain. Tell which are still sexy and which you should stop using and why. And finally I want to give you a peek into the future.","begin_date":"2014-10-18 12:25:00 +0200","end_date":"2014-10-18 13:10:00 +0200","venue":"","language_id":"en"}]},{"id":"25","full_name":"Dominik Witczak","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":" A C/C++ developer who specializes in OpenGL and OpenGL ES APIs.\r\n\r\nDominik is Mobica\u0027s technical representative at Khronos OpenGL ES\r\nWorking Group, who has contributed to both OpenGL and OpenGL ES\r\nspecifications over the course of the last two years. He has also worked\r\non a number of different OpenGL ES extensions (incl. the ones that have\r\nmade it into the recently released Android Extension Pack).\r\n","website_url":"www.mobica.com","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/025/original/dominik.jpg?1410854598","agenda_items":[{"id":"66","title":"New features introduced in OpenGL ES 3.1","description":"In his presentation, Dominik will cover some of the features that were\r\nintroduced in OpenGL ES 3.1. Attendants are expected to have on-hands\r\nexperience with OpenGL ES 3.0. The lecture will be held in Polish.","begin_date":"2014-10-18 09:10:00 +0200","end_date":"2014-10-18 09:55:00 +0200","venue":"","language_id":"pl"}]},{"id":"2","full_name":"Mateusz Herych","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Mateusz works as an Android Developer at Base CRM where he tries to make enterprise software users 10 times more productive. In his free time he still often chooses to stay in the IT world and he is organizing some community events - like KrakDroid conference or GDG Kraków meetups.\r\n\r\n \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/002/original/Mateusz_Herych.jpg?1411158368","agenda_items":[{"id":"6","title":"LIKE \u0027%smth%\u0027 is not the way to go","description":"During the presentation you\u0027ll have a chance to listen about different approaches to the content search problem on Android, especially in apps that need to work offline. Later on, you\u0027ll hear some detailed word about SQLite\u0027s FTS3 native extension and what possibilities it gives to developers.","begin_date":"2014-10-18 14:30:00 +0200","end_date":"2014-10-18 15:15:00 +0200","venue":"","language_id":"en"}]},{"id":"50","full_name":"Bartłomiej  Zass","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Od wielu lat programista .NET. Obecnie konsultant, trener, architekt na co dzień pracujący w Microsoft Polska. Zajmuje się szkoleniem i wspieraniem zespołów technicznych oraz wdrożeniami nowych technologii deweloperskich. Odpowiada przede wszystkim za projekty tworzone wspólnie z największymi w Polsce serwisami internetowymi, operatorami telefonii oraz bankami. Prelegent polskich i zagranicznych konferencji technicznych. \r\n \r\nW wolnych chwilach pasjonuje się fotografią, grafiką komputerową, żeglarstwem i montowaniem różnego rodzaju sprzętu audio. \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/050/original/bzass.jpg?1411504773","agenda_items":[{"id":"72","title":"Usługi dla aplikacji mobilnych","description":"Przegląd usług, pozwalających stworzyć backend dla aplikacji mobilnych (na przeróżne platformy). Od ASP.NET Web API, przez SignalR (usługi utrzymujące stałe połączenie) aż po Azure Mobile Services (prosty backend z autoryzacją, notyfikacjami PUSH, bazą danych) I inne usługi w Microsoft Azure dla aplikacji mobilnych (nie tylko Windows Phone).","begin_date":"2014-10-18 10:15:00 +0200","end_date":"2014-10-18 11:00:00 +0200","venue":"","language_id":"pl"}]},{"id":"61","full_name":"Patryk Ząbkiewicz","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Patryk Ząbkiewicz jest częścią zespołu operacyjnego firmy Bitbar. Realizuje z sukcesem inwestycje w duże farmy testowe na prawdziwych urządzeniach mobilnych.\r\n\r\n \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/061/original/zabkiewicz.jpg?1411504882","agenda_items":[{"id":"85","title":"Tworzenie labolatoriów testowych na dużą skalę","description":"Tworzenie labolatorium do testów aplikacji mobilnych może być okazać się skomplikowanym zadaniem. Przedstawię 5 kruczków, o których możecie nie pomyśleć tworząc labolatorium testowe, a na które my natknęliśmy się podczas tworzenia naszej publicznie dostępnej chmury urządzeń mobilnych jak i labolatoriów testowych bezpośrednio u klientów.","begin_date":"2014-10-18 12:25:00 +0200","end_date":"2014-10-18 13:10:00 +0200","venue":"","language_id":"pl"}]},{"id":"62","full_name":"Sylwester Madej","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Sylwester Madej jest doświadczonym programistą Android oraz trenerem. No co dzień pełni rolę Head of Development w firmie Outline - mobilnym development house, specjalizującym się w Androidzie.\r\nPo godzinach prowadzi bloga soldiersofmobile.com i kanał YouTube, aby dzielić się swoją wiedzą. Stara się wpływać na jakość aplikacji Android przez edukację studentów na Politechnice Warszawskiej. Aktywnie udziela się w imprezach MobileWarsaw i Warsjawa. Pragmatyczny programista, fan TDD i dobrych narzędzi programistycznych. \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/062/original/madej.jpg?1411501822","agenda_items":[{"id":"88","title":"Mirror - szybki development UI dla Androida\t","description":"Mirror to nowe narzędzie, które pozwala zaoszczędzić godziny czasu w ciągu tygodnia, które programiści tracą na kompilacje i instalacje aplikacji. \r\nDzięki niemu każda modyfikacja zasobów w projekcie jest widoczna na urządzeniu w kilka sekund - wystarczy zapisać plik. W trakcie prezentacji pokażę, jak korzystając z Mirror można szybko tworzyć prototypy UI, a nawet mocki.","begin_date":"2014-10-18 16:30:00 +0200","end_date":"2014-10-18 17:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"51","full_name":"Witold  Wysota","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Witold Wysota na codzień pracuje jako inżynier oprogramowania oraz prowadzi zajęcia z Qt na Politechnice Warszawskiej. Od 10 lat aktywnie związany z Qt jako autor artykułów, recenzent książek oraz współzałożyciel,  współadministrator oraz główny gaduła na Qt Centre - forum, gdzie programiści przychodzą po pomoc w tematach związanych z tym narzędziem programistycznym. Uczestnik krajowych i międzynarodowych konferencji naukowych i technicznych. W zeszłym roku na Mobilization poprowadził wykład \"Qt - programowanie mobilne bez nadgodzin\".  \r\n","website_url":"http://www.wysota.eu.org/","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/051/original/wysota.jpg?1411504648","agenda_items":[{"id":"73","title":"Szybkie programowanie gier w Qt Quick","description":"W ramach prezentacji pokazane zostanie jak w szybki sposób stworzyć od podstaw prostą grę na platformy mobilne korzystając z możliwości oferowanych przez Qt. Wykład będzie prowadzony na podstawie platformy Android, natomiast korzystając z wieloplatformowości oferowanej przez Qt, można go zrealizować na pozostałych wspieranych platformach takich jak iOS, SailfishOS, WinRT, Tizen. ","begin_date":"2014-10-18 14:30:00 +0200","end_date":"2014-10-18 15:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"52","full_name":"Mariusz  Lisiecki","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Mariusz has been programming on iOS since 2009. He graduated from Adam Mickiewicz University in Poznan. Mariusz worked for various companies like Roche Polska, eConsulting and SuperMemo World. Currently, he works as Software Development Lead in Allegro Group.  Speaker at Mobilization^3 and Mobile Trends Conference 2014 and WWDC 2014 attendee. Privately, passionate about football, mobile devices, Jaguar® cars and old Lego® sets. \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/052/original/lisiecki.jpg?1411501866","agenda_items":[{"id":"74","title":"Tuningując Xcode","description":"Xcode dla rzeszy programistów iOS to codzienne narzędzie pracy. Wielu jednak nie zdaje sobie sprawy o potencjale drzemiącym w tym narzędziu. Na prezentacji zostanie pokazany szereg sposobów na przyspieszenie pracy z Xcode: od wykorzystania pluginów, poprzez ciekawe a czasami zabawne ukryte funkcje, pro skróty klawiaturowe, do tworzenia własnych szablonów projektów. Mam nadzieję, że każdy znajdzie w tej prezentacji coś dla siebie co przybliży go do osiągnięcia tytułu Xcode Ninja ;)","begin_date":"2014-10-18 14:30:00 +0200","end_date":"2014-10-18 15:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"73","full_name":"Anna Maria Sperka","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Projektantka interfejsów, fanka użyteczności i miłośniczka prostoty. Absolwentka informatyki (spec. Grafika Komputerowa i Multimedia) na Politechnice Łódzkiej, od 2012 r. UI/UX Designer w firmie Mobica. Zajmuje się projektowaniem na szeroko pojęte urządzenia mobilne, dobrze zapoznana z procesem projektowym i jego kolejnymi etapami. Uczestniczka i prelegentka na łódzkich spotkaniach społeczności Geek Girls Carrots, jedna z \"ojców założycieli\" inicjatywy propagującej user experience w Łodzi. Fanka Androida, ale nie stroni od iOSa. Uczulona na Comic Sansa. \r\n\r\nW wolnych chwilach realizuje projekty DIY.\r\n","website_url":"annart.info","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/073/original/am_sperka_L.png?1411982936","agenda_items":[{"id":"98","title":"Współpraca projektanta i programisty - jak pogodzić dwa światy","description":"Chciałabym poruszyć temat współpracy na linii projektant \u003c\u003e programista i zastanowić się, w jaki sposób można by ograniczyć niepotrzebne konflikty, poprawić komunikację i uczynić wspólną pracę jak najbardziej bezbolesną.\r\n\r\nZależy mi również na tym, by pokrótce przybliżyć to, czym się zajmuje UI/ UX designer, a także by pokazać, że dobre wspomnienia z pracy nad projektem zależą od każdej z osób biorących w nim udział. Chcę spojrzeć na zagadnienie z obu stron, przedstawiając zarówno uwagi/zarzuty projektantów jak i programistów, jednocześnie skupiając się na tym, co należy zrobić, jakie środki podjąć, aby wyeliminować jak najwięcej problemów i polepszyć współpracę.","begin_date":"2014-10-18 11:20:00 +0200","end_date":"2014-10-18 12:05:00 +0200","venue":"","language_id":"pl"}]},{"id":"70","full_name":"Jakub Waliński","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Kapral Waliński już w bardzo młodym wieku zaczął ponadnormatywnie interesować się komputerami, co poskutkowało wcieleniem go w szeregi Politechniki Łódzkiej, gdy tylko uzyskał pełnoletność. W swojej karierze miał okazję walczyć za pomocą zróżnicowanego oręża (np. Java, PHP, ASP.NET/C#, C++, Python), na wielu polach bitew (od startupu, przez SME, aż po korpo-świat). Obecnie najczęściej stosuje najpopularniejszy na świecie wielozadaniowy karabin szturmowy o nazwie JavaScript, z pomocą którego podbija zarówno Internety jak i Smartfony. Ostatnio otrzymał powołanie do służby w łódzkim batalionie Centrum Systemów Informatycznych ABB. W wolnym czasie kapral Waliński jeździ na rowerze i słucha audiobooków\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/070/original/kubawalinski.jpg?1411970300","agenda_items":[{"id":"93","title":"Ionic Framework, czyli jak podbić smartfony i tablety z pomocą JavaScriptu","description":"Ionic Framework to nowe narzędzie pozwalające tworzyć zaawansowane aplikacje mobilne na iOS i Androida. Pozwala on programistom webowym rozpocząć przygodę z programowaniem mobilnym wykorzystując ich znajomość JavaScriptu. Na tej sesji poznasz podstawy AngularJS, na którym oparty jest Ionic oraz zobaczysz na żywo jak powstaje aplikacja mobilna korzystająca z tego frameworka.","begin_date":"2014-10-18 09:10:00 +0200","end_date":"2014-10-18 09:55:00 +0200","venue":"","language_id":"pl"}]},{"id":"58","full_name":"Wojciech  Kaliciński","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Współzałożyciel i CTO agencji interaktywnej Kalicińscy.com. obecnie kieruje zespołem zajmującym się tworzeniem aplikacji mobilnych pod marką We Like CAPS! Lubi dzielić się wiedzą i doświadczeniem z innymi entuzjastami nowych technologii na spotkaniach organizowanych przez Google Developer Groups i nie tylko. Jako Google Developer Expert interestuje się wszystkim co związane z Androidem. \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/058/original/kalici%C5%84ski.jpg?1411503141","agenda_items":[{"id":"86","title":"Android Wear","description":"Android Wear to nowa edycja systemu Android przeznaczona specjalnie na inteligentne zegarki. Istnieje kilka prostych sposobów, abyś jako deweloper mógł dodać wsparcie dla Android Wear w swoim kodzie. Aby jednak mieć pewność, że twoja appka zagości na nadgarstku użytkowników na stałe, musisz oduczyć się niektórych przyzwyczajeń z projektowania na mobile. W tej prezentacji pokażę czego unikać, co robić i jak to robić podczas tworzenia interfejsów na Android Wear.\r\n","begin_date":"2014-10-18 10:15:00 +0200","end_date":"2014-10-18 11:00:00 +0200","venue":"","language_id":"pl"}]},{"id":"56","full_name":"Filip Miłoszewski","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Co-founder of Listonic, one of the most popular Polish apps, available on Android, iPhone, Windows Phone and few other platforms. Working on mobile apps since 2007.\r\n\r\nSpeaker on many conferences including:\r\nInternet Beta, Mobile Standard, Mobile Trends for Business, Akademia Mediarun, App Academy, Jungle Web, Łódź WiOSłuje, MIT and more.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/056/original/filip.jpg?1411501931","agenda_items":[{"id":"79","title":"Projektowanie aplikacji iOS - wzorce i triki które każdy programista wiedzieć powinien. ","description":"Chciałem zaprezentować kilkanaście praktycznych metod/hacków/wzorów które sprawią, że osoba\r\nnie interesująca się na co dzień UX, nie korzystająca z Photoshopa będzie w stanie tworzyć bardziej użyteczne i lepiej zaprojektowane aplikacje. Tylko praktyczne porady, często występujące problemy i rozwiązania które może zastosować praktycznie każdy developer iOS. (sam temat może ulec lekkiej zmianie), pomysł na prezentację dokładniej omówiłem z Rafałem Lenarczykiem.\r\n\r\nEwentualnie mogę również ciekawie opowiedzieć o kwestii marketingu aplikacji mobilnych. Przykładowy tytuł takiej prezentacji mogłaby brzmieć - \"Marketing aplikacji na iOS - tips \u0026 tricks\"","begin_date":"2014-10-18 15:30:00 +0200","end_date":"2014-10-18 16:15:00 +0200","venue":"","language_id":"en"}]},{"id":"64","full_name":"Kamil Grondys","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Kamil Grondys, który od ponad 5 lat pracuje w Samsung R\u0026D Institute Poland, na codzień kieruje pracą zespołu odpowiedzialnego za tworzenie artykułów technicznych i przykładowych aplikacji na stronę Tizen Developers, a także tworzy aplikacje na najnowsze urządzenia Samsung (m.in. Gear 2 i Gear S) dla Samsung Galaxy Store.  Jako prelegent miał okazję sprawdzić się na ponad 20 międzynarodowych konferencjach w 15 krajach.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/064/original/grondys.jpg?1411501749","agenda_items":[{"id":"65","title":"Tizen ecosystem","description":"Tizen to platforma open-source wspierana przez różnych operatorów i producentów sprzętu. Dedykowana jest różnym urządzeniom: od mobilnych, poprzez telewizory, a skończywszy na znajdujących się w samochodach.Podczas tej prezentacji, uczestnicy poznają jaka jest wizja i cele Platformy, a także wskazówki dotyczące narzędzi, za pomocą których można przygotować aplikacje i rozwiązania w oparciu o platformę Tizen","begin_date":"2014-10-18 09:10:00 +0200","end_date":"2014-10-18 09:55:00 +0200","venue":"","language_id":"pl"}]},{"id":"60","full_name":"Michał Walędziak","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Programista aplikacji mobilnych z wieloletnim doświadczeniem. Współpracował z wieloma firmami i instytucjami pomagając tworzyć aplikacje biznesowe, reklamowe i rozrywkowe. Aktualnie konsultant w firmie Cybercom. Fan koszykówki, boksu, książek Stevena Kinga, Philipa K. Dicka i Howarda P. Lovecrafta, oraz oczywiście wszelkich technologii mobilnych.\r\n\r\n \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/060/original/walendziak.jpg?1411504398","agenda_items":[{"id":"89","title":"Prosty serwer z Push Notifications dla aplikacji mobilnych bez umiejętności programowania po stronie serwera","description":"Jak często masz świetny pomysł na aplikację ale nie znasz nikogo, kto może pomóc Ci stworzyć serwer dla projektu? \r\nIle razy zdarzyło Ci się zrezygnować z niektórych funkcjonalności, bo nie nie wiedziałeś/nie wiedziałaś jak stworzyć komunikację serwerową, czy Push Notifications dla Twojej aplikacji? \r\nCzy zdarzyła Ci się sytuacja w której przy bardzo ograniczonym czasie musiałeś/musiałaś stworzyć aplikację mobilną komunikującą się z serwerem, jednak nie było czasu na to by zwoływać zespół backendowy by uzgadniać protokół sieciowy, komunikację, wymianę informacji ?\r\nJeśli zdarzały Ci się takie sytuacje i chcesz uniknąć ich w przyszłości przyjdź i posłuchaj, jak w ciągu kilku minut i \"\"kliknięć\"\" stworzyć serwer dla Twojej aplikacji mobilnej. \r\n\r\nWykład będzie oparty na tworzeniu aplikacji na system Android, ale prezentowane rozwiązanie współpracuje również z systemami iOS, OS X, Windows Phone etc.","begin_date":"2014-10-18 14:30:00 +0200","end_date":"2014-10-18 15:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"49","full_name":"Konrad  Dzwinel","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Konrad jest front-end developerem w Making Waves Polska, ekspertem, w ramach programu Google Developer Experts, z zakresu przeglądarki Chrome oraz współorganizatorem krakowskiego Google Developers Group. W Making Waves zajmuje sie, od półtora roku, aplikacjami hybrydowymi. Po godzinach rozwija rozszerzenia do przeglądarki Chrome, eksperymentuje z rozmaitymi technologiami front-end\u0027owymi, prowadzi warsztaty i prezentacje.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/049/original/konrad_dzwinel.jpg?1411159335","agenda_items":[{"id":"71","title":"Rzeczy których nauczyłem sie pracując nad hybrydowymi aplikacjami","description":"Aplikacje hybrydowe (aplikacje mobilne zbudowane w technologiach webowych) od zawsze były uważane za rozwiązanie kontrowersyjne. Jednak patrząc na ich rosnącą popularność, możemy być przekonani, że nie jest to technologia która odchodzi do lamusa.\r\n\r\nPodczas mojej perezentacji postaram się wyjaśnić czym są aplikacje hybrydowe oraz porównać je z ich głównymi alternatywami: aplikacjami natywnymi i webowymi. Podzielę się też moimi doświadczeniami i najważniejszymi wnioskami które wyciągnełem przez półtora roku mojej pracy nad \"hybrydami\".","begin_date":"2014-10-18 11:20:00 +0200","end_date":"2014-10-18 12:05:00 +0200","venue":"","language_id":"pl"}]},{"id":"57","full_name":"Michał Tajchert","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Polidea Android Developer.\r\nWarsaw GDG Organizer.\r\nDeveloper of 12Hours Android widget.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/057/original/tejchert.jpg?1411503520","agenda_items":[{"id":"87","title":"Android Wear od rozpozanawiania mowy do własnych cyferblatów","description":"Chciałbym zapoznać uczestników z tym jak pisać: Watchaface, Activity, Notifications etc. na Android Wear i o czym warto pamiętać (prezentacja z kawałkami kodu)","begin_date":"2014-10-18 11:20:00 +0200","end_date":"2014-10-18 12:05:00 +0200","venue":"","language_id":"pl"}]},{"id":"65","full_name":"Marcin Kłosiński","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Marcin Kłosiński pracuje w Transition Technologies S.A. od ponad 6 lat i jest obecnie ekspertem ds. oprogramowania. Na co dzień zajmuje się nie tylko tworzeniem oprogramowania, lecz również kontaktami z klientem, dyskusji rozwiązań oraz prowadzeniem szkoleń w Polsce i za granicą. Ponadto koordynuje współpracę z łódzkimi uczelniami w ramach programów B+R oraz w celu prowadzenia przedmiotów przybliżających studentom temat programowania dla biznesu. Prywatnie interesuje się zagadnieniami sztucznej inteligencji i pracuje nad doktoratem oraz w wolnych chwilach trenuje squash’a.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/065/original/klosinski.jpg?1411505685","agenda_items":[{"id":"77","title":"SkyNet is coming, welcome to Intenet of Things era.","description":"Na prezentacji zostanie przeprowadzona prelekcja na temat ciekawych inicjatyw realizowanych przez Transition Technologies S.A. w coraz to bardziej rosnącej na popularności domenie Internet of Things. Zaprezentowane zostaną projekty, zarówno realizowane, jak i te w fazie koncepcji. Prezentacja zakończy się ciekawą niespodzianką dla publiczności","begin_date":"2014-10-18 09:10:00 +0200","end_date":"2014-10-18 09:55:00 +0200","venue":"","language_id":"pl"}]},{"id":"21","full_name":"Chris Wacławek","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":" Chris is Contextual Computing Evangelist at Estimote, Inc. He works with community of over 20 000 developers worldwide inspiring them and helping them deliver cutting-edge beacon enabled solutions.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/021/original/waclawek.jpg?1411504084","agenda_items":[{"id":"67","title":"World of beacon enabled apps","description":"What is the state of the art when it comes to enabling context inside your apps?\r\nWhat\u0027s possible with beacons? What\u0027s not possible and should be avoided?\r\nWhat are the best use cases and guidelines up to date and what\u0027s coming next?","begin_date":"2014-10-18 11:20:00 +0200","end_date":"2014-10-18 12:05:00 +0200","venue":"","language_id":"en"}]},{"id":"47","full_name":"Sergey  Tarasevich","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Android developer at CactusSoft (Belarus), certified Java 7 programmer, author of the popular open source library for Android - Universal Image Loader.\r\nAttended in Mobile Optimized 2014 conference in Minsk (http://mo.dev.by), reported presentation \"Universal Image Loader: Story, Architecture, FAQ\". \r\n","website_url":"http://nostra13android.blogspot.com/","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/047/original/sergey_tarasevich.jpg?1411158881","agenda_items":[{"id":"70","title":"Universal Image Loader: Story, Architecture, FAQ","description":"Presentation contains 3 parts:\r\n1) Brief story about project history: how it was born, grew and become what it is.\r\n2) Library structure, internal features. It will be useful for those who use the library or plan to use it.\r\n3) Short FAQ about the project with comments.","begin_date":"2014-10-18 14:30:00 +0200","end_date":"2014-10-18 15:15:00 +0200","venue":"","language_id":"en"}]},{"id":"72","full_name":"Lena Rodziewicz","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Z programowaniem webowym jestem zawodowo związana ponad 9 lat. W miarę rozwoju możliwości przeglądarek z dedykowanych rozwiązań serwerowych zmieniłam moją specializację na tworzenie stanowych aplikacji w JavaScript. W ciągu ostatnich lat miałam szczeście do projektów na granicy możliwości technologicznych HTML5 co dało mi ciekawe doświadczenie w tym polu.\r\nJestem zafascynowana możliwościami jakie dają nowe Web Components API oraz specyfikacja HTML 5.1.\r\nJako prelegent brałam udział w jednej z poprzednich edycji Mobilization, Google DevFest oraz drugi rok z rzędu organizowałam Google I/O Extended Łódź.      \r\n","website_url":"rodziewicz.com.pl","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/072/original/lena.jpg?1411969128","agenda_items":[{"id":"96","title":"Web Components - Polimer ale nie tylko","description":"Web Components wiele osób kojarzy jedynie z Polymer, sytuacja, jak to zwykle bywa jest bardziej skomplikowana. Zaczynając od Mozilla Brick a kończąc na wykorzystaniu natywnych API wsparcie dla tych nadchodzących technologi wygląda coraz bardziej obiecująco.\r\nJakie zmiany dla osób zajmujących się frontendem tak na prawdę niosą ze sobą komponenty?\r\nChciałabym podzielić się moimi doświadczeniami z tą technologią, przykładami nietrywialnych zastosowań oraz korzyści płynących z jej użycia.","begin_date":"2014-10-18 16:30:00 +0200","end_date":"2014-10-18 17:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"68","full_name":"Daniel  Chruściak","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Programista w JAVEO odpowiedzialny za rozwój produktów i usług mobilnych na platformie Android. \r\n\r\n \r\n\r\n \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/068/original/chrusciak.jpg?1411968809","agenda_items":[{"id":"92","title":"Android do usług, czyli ultralekkie serwisy na urządzeniach mobilnych","description":"Żyjemy w świecie, w którym codziennie pojawia się wiele nowych wersji urządzeń, systemów i aplikacji. Internet jest dziś powszechnie dostępny i mamy go w kieszeni, w postaci smartfona.  Posiadamy też wiele innych urządzeń przenośnych, takich jak tablety, odtwarzacze, kamery itp., które łączą się przez Internet. Każde z nich ma unikalne cechy i funkcje. Chcielibyśmy mieć do nich dostęp zawsze i wszędzie.\r\n\r\nPokażemy Wam w jaki sposób, przy wykorzystaniu architektury mikroserwisów, można tworzyć ultralekkie usługi na urządzeniach działających pod kontrolą systemu Android i wykorzystywać je w aplikacjach. Wasze urządzenia i aplikacje mogą być dostępne przez przeglądarkę, mogą też się ze sobą łączyć i wymieniać dane. Wspólnie, na żywo, zbudujemy aplikację mobilną w taki sposób, aby można było korzystać z jej funkcji przez przeglądarkę.\"","begin_date":"2014-10-18 12:25:00 +0200","end_date":"2014-10-18 13:10:00 +0200","venue":"","language_id":"pl"}]},{"id":"53","full_name":"Mieszko Lassota","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Doświadczony programista, designer, (prawie)grafik i ewangelista Microsoftu (jakimś cudem tak zawsze wychodzi). Don Corleone w KODD.pl (software house) oraz Dessigne.com (design house), w których projektuje i implementuje wyborne oprogramowanie. Od zawsze związany z technologiami .NETowymi stworzył m.in. Verbalize, Proto, 9GAG.com dla Windows Phone oraz współtworzył FreeMetera. Papierki poświadczające, że naprawdę coś umie, a nie tylko lans: MS Technology Specialist (Siliverlight 4), Programming in C# Specialist, Certified Scrum Master, Nokia Certified Developer Trainer (Windows Phone) oraz LTE DVD USB LE 3.1.\r\n\r\n \r\n","website_url":"kodd.pl","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/053/original/mieszko_lassota.jpg?1411164406","agenda_items":[{"id":"75","title":"Cztery podstawy projektowania oprogramowania","description":"Sądzisz, że projektowanie oprogramowania jest zbyt trudne? Opowiem Ci, jak w czterech krokach wkroczyć w wspaniały świat designu.","begin_date":"2014-10-18 10:15:00 +0200","end_date":"2014-10-18 11:00:00 +0200","venue":"","language_id":"pl"}]},{"id":"66","full_name":"Cesare Rocchi","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Cesare Rocchi is a speaker, writer, UX designer and developer specializing in web and mobile applications. He began working on interactive applications while he was a researcher in the academia. He runs Studio Magnolia, an interactive studio that creates compelling web and mobile applications. You can find him on Twitter (@_funkyboy). When off duty he enjoys snowboard and beach tennis.\r\n","website_url":"cesarerocchi.com","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/066/original/Cesare_Rocchi.jpg?1411502004","agenda_items":[{"id":"78","title":"Apps and Mental Models","description":"When devising an app we make oceans of decisions. Some are dictated by personal preferences, some by principles, some by elaborating feedback on beta versions and some by taking inspiration from other apps. A posteriori, depending on the \"success\" of the app we can say which decisions were right or wrong. An alternative approach is based on Mental Models, \"minimal pictures\" that can be used to describe how people learn and interact. Before buying an app your customer has already a mental model of how it should work. Knowing more about that model helps you a lot to devise an experience that matches customers\u0027 expectations.","begin_date":"2014-10-18 12:25:00 +0200","end_date":"2014-10-18 13:10:00 +0200","venue":"","language_id":"en"}]},{"id":"48","full_name":"Krzysztof  Zabłocki","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Programuje od 8 roku życia, od 5 lat na iOS. Pracowałem nad szerokim zakresem aplikacji od typowo biznesowych po rozrywkę i gry, przez 1.5 roku mieszkałem w Londynie gdzie kierowałem dużym zespołem programistów (10+), między innymi całkowicie zmieniając flotę mobilnych aplikacji News International. Oprócz tego prowadzę bloga merowing.info oraz tworzę swoje własne aplikacje takie jak Foldify http://foldifyapp.com czy Bord http://bord.pixle.pl \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/048/original/krzysztof_zablocki.jpeg?1411159343","agenda_items":[{"id":"81","title":"Jak pisać mniej kodu?","description":"O tym jak wykorzystać mniej znane bądź bardziej zaawansowane techniki dostępne dla programistów Objective-C aby zmniejszyć ilość i zwiększyć jakość i czytelność pisanego kodu, techniki takie jak tworzenie DSL, wykorzystanie meta-programmingu i Objective-C runtime.","begin_date":"2014-10-18 10:15:00 +0200","end_date":"2014-10-18 11:00:00 +0200","venue":"","language_id":"pl"}]},{"id":"71","full_name":"Tomek Pająk","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Engineering Team Lead @ Seamless, IT Coach @ Sages, Professional Scrum Master / Professional Scrum Product Owner, student \u0027MBA dla IT\u0027 na Akademii Leona Koźmińskiego.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/071/original/pajak.jpg?1411968886","agenda_items":[{"id":"97","title":"Płacisz nadal kartą lub gotówką, czy już telefonem?","description":"Niedawno Apple ogłosiło, że tworzy w USA własny system płatności mobilnych Apple Pay. W Polsce joint venture 6 banków (PKO BP + mBank + ING + BZWBK + Alior + Millenium) pracuje nad Polskim Standardem Płatności. Jako Seamless już 2 lata temu \r\nuruchomiliśmy nasz system płatności mobilnych SEQR. Początkowo była to Szwecja, obecnie jest to dodatkowo Finlandia, Belgia i Rumunia, a niedługo będą to inne kraje strefy Euro, UK oraz USA. Każdy walczy o kawałek tortu dla siebie, ponieważ według wróżbitów rynek płatności mobilnych powinien być wart w 2017 roku ok. 720 mld USD przy 450 mln użytkowników. Droga tam jednak nie jest taka różowa i oprócz walki z konkurencją wymaga przekonania ludzi, że lepiej płacić telefonem niż kartą. Prezentacja w sposób przekrojowy (techniczny, biznesowy, marketingowy i prawny) spojrzy na wyzwania, szanse i ryzyka jakie niosą ze sobą płatności mobilne z perspektywy gracza, który już kilka lat jest na tym rynku.","begin_date":"2014-10-18 15:30:00 +0200","end_date":"2014-10-18 16:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"22","full_name":"Anastazia Kazakova","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Being C/C++ fan Anastasia has been creating real-time *nix-based systems and pushing them to the production for 8 years. She has passion for networking algorithms and embedded programming and believes in good tooling. Now she is a part of JetBrains team working as a Product Marketing Manager for AppCode and CLion (the upcoming C/C++ IDE).\r\n\r\n \r\n","website_url":"https://twitter.com/anastasiak2512","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/022/original/M7HVldqZ.jpeg?1410854600","agenda_items":[{"id":"84","title":"Tools and Techniques that help maintain a high quality code base","description":"It\u0027s obvious that nowadays just having working code is not enough. As projects and teams grow, the code often starts to diminish in quality, which increases maintainability costs. Code should be clean and concise. It should be easy to understand and consequently easy to maintain. A \"GOTO FAIL\" shouldn\u0027t ever pass! \r\n\r\nDozens of tools and techniques exist to help developers keep their code base clean and of high quality. During this talk we\u0027re going to see what is available in the iOS/OSX space and see how combining these with good practices such as unit testing, we can help identify bugs, code smells and refactor to produce a better code base.","begin_date":"2014-10-18 12:25:00 +0200","end_date":"2014-10-18 13:10:00 +0200","venue":"","language_id":"en"}]},{"id":"67","full_name":"Jacek Zadrąg","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Założyciel i współwłaściciel JAVEO, entuzjasta nowych technologii i zwinnych metod rozwoju oprogramowania. Od wielu lat wymyśla sposoby na to jak lepiej, szybciej i sprawniej tworzyć oprogramowanie. Zwolennik i propagator ruchu Open Source.\r\n\r\nBrał udział jako prelegent w konferencjach Confitura, Warsjawa, GigaCon itp.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/067/original/zadrag.jpg?1411970498","agenda_items":[{"id":"92","title":"Android do usług, czyli ultralekkie serwisy na urządzeniach mobilnych","description":"Żyjemy w świecie, w którym codziennie pojawia się wiele nowych wersji urządzeń, systemów i aplikacji. Internet jest dziś powszechnie dostępny i mamy go w kieszeni, w postaci smartfona.  Posiadamy też wiele innych urządzeń przenośnych, takich jak tablety, odtwarzacze, kamery itp., które łączą się przez Internet. Każde z nich ma unikalne cechy i funkcje. Chcielibyśmy mieć do nich dostęp zawsze i wszędzie.\r\n\r\nPokażemy Wam w jaki sposób, przy wykorzystaniu architektury mikroserwisów, można tworzyć ultralekkie usługi na urządzeniach działających pod kontrolą systemu Android i wykorzystywać je w aplikacjach. Wasze urządzenia i aplikacje mogą być dostępne przez przeglądarkę, mogą też się ze sobą łączyć i wymieniać dane. Wspólnie, na żywo, zbudujemy aplikację mobilną w taki sposób, aby można było korzystać z jej funkcji przez przeglądarkę.\"","begin_date":"2014-10-18 12:25:00 +0200","end_date":"2014-10-18 13:10:00 +0200","venue":"","language_id":"pl"}]},{"id":"69","full_name":"Maciej  Schmidt","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Od kilku lat specjalizuję się w technologii Rzeczywistości Rozszerzonej (Augmented Reality) na urządzenia mobilne oraz tworzę użytkowe i rozrywkowe aplikacje mobilne.\r\n\r\nMoja firma MASKOM.pl prężnie rozwija własną platformę AR pod nazwą ARmobile, dzięki której nasi klienci mogą szybko i stosunkowo niskim kosztem wdrożyć technologię AR w swojej firmie. Dodatkowo wykonujemy dedykowane oprogramowanie na PC oraz strony i sklepy internetowe RWD.\r\n\r\nW marcu br. wystawialiśmy się na I Targach Mobilnych w Warszawie, które okazały się dla nas dużym sukcesem wizerunkowym, co przełożyło się na wiele kontaktów biznesowych. \r\n\r\nW moim portfolio znajdują się realizacje m.in. dla sieci Rossmann (aplikacja AR), RTV Euro AGD (systemy mobilne dla pracowników), PKP S.A., Advanced Digital Broadcast Polska, czy klubu żużlowego Falubaz Zielona Góra (aplikacja AR).\r\n\r\nMam bogate doświadczenie zdobyte w wielu prezentacjach moich produktów oraz przeprowadzanych szkoleniach z zakresu ich obsług\r\n\r\n \r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/069/original/no_pic.jpeg?1411970579","agenda_items":[{"id":"91","title":"Wprowadzenie do Augmented Reality dla laików i dla developerów","description":"Chciałbym zaprezentować kilka informacji dotyczących technologii Rzeczywistości Rozszerzonej (Augmented Reality). Co to jest AR? Jakie są podstawowe obszary jej zastosowania? Co nowego może wnieść technologia AR w już używanych aplikacjach wraz z prezentacją kilku wykonanych przez nas aplikacji.\r\n\r\nW części developerskiej chciałbym pokazać jak łatwo i szybko można stworzyć aplikację AR wykorzystując środowisko UNITY i technologię Qualcomm Vuforia. \r\n\r\nNa koniec prezentacji oczywiście kilkuminutowa sesja Q\u0026A","begin_date":"2014-10-18 16:30:00 +0200","end_date":"2014-10-18 17:15:00 +0200","venue":"","language_id":"pl"}]},{"id":"59","full_name":"Tomasz Grynfelder","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Tomasz Grynfelder, Software Engineer at Polidea, mobile technologies freak highly focused on iOS development and security. Great fan of cycling and sailing\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/059/original/tomek-3.png?1411416428","agenda_items":[{"id":"80","title":"Reverse Engineering in iOS","description":"If you still believe, that your app is safe because it has been submitted to Apple\u0027s Appstore and protected with Apple\u0027s DRM - FairPlay, if you are still not worried about your code and app specific secrets, you should change your attitude. Have a sneak peak of ways to bundle app analysis and harden your app from reverse engineering and common security vulnerabilities","begin_date":"2014-10-18 15:30:00 +0200","end_date":"2014-10-18 16:15:00 +0200","venue":"","language_id":"en"}]},{"id":"74","full_name":"Heiko  Shilling","job_title":"","organization":"#\u003cOrganization:0x007f9f9039a7d8\u003e","description":"Since 8 years I work for TomTom. At TomTom I am the Fellow Navigation, the highest level in the technical career ladder and a discretionary appointment by the TomTom management board. I contributed to TomTom’s unique product portfolio in different technical and management roles. I am now responsible for one of TomTom’s core navigation products: NavKit, the navigation engine software, used by over 80 million customers and driven over 300 billion kilometers by our customers. Before TomTom, as an entrepreneur, I co-founded a start-up company that I ran successfully for 6 years and sold in 1995. Our main product was an online shop system for bookstores, a very innovative idea at a time when the Internet age had not started yet. I also worked for 2 start-up companies at the peak time of the dot-com boom. At university I successfully completed 3 degrees (PhD, MSc, BA) and contributed to a range of optimization solutions in the transportation industry that saved money and/or time. Currently I do a part-time EMBA course at Cambridge University, UK.\r\n","website_url":"","picture_url":"http://s3-eu-west-1.amazonaws.com/organizujto/e/rwagkpzyqboffbt/p/agenda_people/pictures/000/000/074/original/HeikoSchilling.png?1412368739","agenda_items":[{"id":"99","title":"From Connected Cars to Highly Automated Vehicles","description":"The last decade has seen tremendous change in the geolocation market. This year we will celebrate the 10th anniversary of the Personal Navigation Device (Sat-Nav). Sat-Navs and GPS-enabled smartphones significantly changed the geolocation market in Consumer Electronics and beyond and many consumers consider them already a commodity. As a result of such rapid developments in the Consumer Electronics market consumer expectations are about to change the Automotive industry at a similar pace. In the Automotive market cars are now connected to the network, are exchanging information and become a node in a larger system – the connected car is a reality and enables much more advanced automated vehicle use cases. For such use cases TomTom has developed a wide range of In-Vehicle Infotainment (IVI) components for Navigation, Advanced Driver Assistance System (ADAS) and geolocation services. This talk will give an overview of TomTom’s IVI components like run time maps, traffic services, navigation services including an outlook of further developments. See here for more information: http://youtu.be/-FWMV3XzGMU \u0026 http://youtu.be/m7gIXqzZQQc","begin_date":"2014-10-18 11:20:00 +0200","end_date":"2014-10-18 12:05:00 +0200","venue":"","language_id":"en"}]}]}}